#+Title: Exercises in Mathematics, Algorithmics and Computer Programming
#+AUTHOR: Evans Winner
#+OPTIONS: tex:verbatim 
#+OPTIONS: tex:t
#+LaTeX_CLASS: article

* Introduction

First, this is the Emacs Lisp that is required in order to export the
org-mode buffer of this file to PDF:

#+begin_src emacs-lisp
(require 'org-install)
(require 'ob-tangle)
(require 'ob-shen)
(require 'ox-latex)
(require 'ob-scheme)
(setq org-latex-pdf-process '("lualatex %f"))
(setq org-src-fontify-natively t)
(setq org-latex-listings nil) ; doesn’t work because the LaTeX
                              ; ‘listings’ package doesn’t have
                              ; a shen backend.

(setq org-latex-default-packages-alist
      '(
       ("" "amsmath" t)
       ("" "amsthm" t)
       ("T1" "fontenc" t)
       ("" "fixltx2e" nil)
       ("" "graphicx" t)
       ("" "longtable" nil)
       ("" "float" nil)
       ("" "wrapfig" nil)
       ("normalem" "ulem" t)
       ("" "textcomp" t)
       ("" "marvosym" t)
       ("" "wasysym" t)
       ("" "latexsym" t)
       ("" "amssymb" t)
       ("" "amstext" nil)
       ("" "hyperref" nil)
       ("" "fontspec" t)
       ("" "tabularx" t)
       ("" "enumerate" t)
       ("utf8x" "luainputenc" t)
       ("" "unicode-math" t0)
       "\\setmathfont{Latin Modern Math}"
       "\\setmathfont{STIXGeneral}"
       "\\tolerance=1000"))
(org-babel-do-load-languages
 'org-babel-load-languages
 '((scheme . t)
   (emacs-lisp . t)
   ))
#+end_src

#+RESULTS:
| (scheme . t) | (emacs-lisp . t) |

